# ShowWS

## Description
Sets the display status of the referenced worksheet.

```pascal
PROCEDURE ShowWS(
				worksheet : HANDLE;
				show      : BOOLEAN);
```

```python

def vs.ShowWS(worksheet, show):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheet|HANDLE|Handle to worksheet.|
|show|BOOLEAN|Desired display status of worksheet|

## Version
Availability: from VectorWorks9.0
## Category
* Worksheets